; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-5-3)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	person1 - person
	person2 - person
	person3 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	)
(:init
	(at plane1 city2)
	(= (capacity plane1) 2784)
	(= (fuel plane1) 894)
	(= (slow-burn plane1) 1)
	(= (fast-burn plane1) 3)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 7)
	(at plane2 city4)
	(= (capacity plane2) 14483)
	(= (fuel plane2) 3158)
	(= (slow-burn plane2) 5)
	(= (fast-burn plane2) 11)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 2)
	(at plane3 city5)
	(= (capacity plane3) 9193)
	(= (fuel plane3) 1012)
	(= (slow-burn plane3) 3)
	(= (fast-burn plane3) 7)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 6)
	(at plane4 city0)
	(= (capacity plane4) 9619)
	(= (fuel plane4) 2710)
	(= (slow-burn plane4) 4)
	(= (fast-burn plane4) 10)
	(= (onboard plane4) 0)
	(= (zoom-limit plane4) 8)
	(at plane5 city1)
	(= (capacity plane5) 2335)
	(= (fuel plane5) 176)
	(= (slow-burn plane5) 1)
	(= (fast-burn plane5) 2)
	(= (onboard plane5) 0)
	(= (zoom-limit plane5) 8)
	(at person1 city3)
	(at person2 city3)
	(at person3 city2)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 917)
	(= (distance city0 city2) 534)
	(= (distance city0 city3) 738)
	(= (distance city0 city4) 984)
	(= (distance city0 city5) 726)
	(= (distance city1 city0) 917)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 822)
	(= (distance city1 city3) 564)
	(= (distance city1 city4) 801)
	(= (distance city1 city5) 896)
	(= (distance city2 city0) 534)
	(= (distance city2 city1) 822)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 809)
	(= (distance city2 city4) 771)
	(= (distance city2 city5) 708)
	(= (distance city3 city0) 738)
	(= (distance city3 city1) 564)
	(= (distance city3 city2) 809)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 855)
	(= (distance city3 city5) 930)
	(= (distance city4 city0) 984)
	(= (distance city4 city1) 801)
	(= (distance city4 city2) 771)
	(= (distance city4 city3) 855)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 998)
	(= (distance city5 city0) 726)
	(= (distance city5 city1) 896)
	(= (distance city5 city2) 708)
	(= (distance city5 city3) 930)
	(= (distance city5 city4) 998)
	(= (distance city5 city5) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane2 city1)
	(at plane3 city4)
	(at person1 city1)
	(at person2 city3)
	(at person3 city0)
	))

(:metric minimize (+ (* 4 (total-time))  (* 3 (total-fuel-used))))
)

; plan
1. (refuel plane2 city4)
   changed: (fuel plane2) from 3158 to 14483
   goals met: 1 of 5
2. (fly plane2 city4 city3)
   deleted: (at plane2 city4)
   added: (at plane2 city3)
   changed: (total-fuel-used) from 0 to 4275, (fuel plane2) from 14483 to 10208
   goals met: 1 of 5
3. (refuel plane3 city5)
   changed: (fuel plane3) from 1012 to 9193
   goals met: 1 of 5
4. (fly plane3 city5 city4)
   deleted: (at plane3 city5)
   added: (at plane3 city4)
   changed: (total-fuel-used) from 4275 to 7269, (fuel plane3) from 9193 to 6199
   goals met: 2 of 5
5. (board person1 plane2 city3)
   deleted: (at person1 city3)
   added: (in person1 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 2 of 5
6. (fly plane2 city3 city1)
   deleted: (at plane2 city3)
   added: (at plane2 city1)
   changed: (total-fuel-used) from 7269 to 10089, (fuel plane2) from 10208 to 7388
   goals met: 3 of 5
7. (debark person1 plane2 city1)
   deleted: (in person1 plane2)
   added: (at person1 city1)
   changed: (onboard plane2) from 1 to 0
   goals met: 4 of 5
8. (board person3 plane1 city2)
   deleted: (at person3 city2)
   added: (in person3 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 4 of 5
9. (fly plane1 city2 city0)
   deleted: (at plane1 city2)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 10089 to 10623, (fuel plane1) from 894 to 360
   goals met: 4 of 5
10. (debark person3 plane1 city0)
   deleted: (in person3 plane1)
   added: (at person3 city0)
   changed: (onboard plane1) from 1 to 0
   goals met: 5 of 5
